var newVersion = {
    "SrcJuying":"0.4",
    "JYUpdateRecords": [{
        title: "2024/07/01 V0.1",
        records: [
            "重构：聚影2.0，重新起航",
            "重构：app、cms、biubiu、xpath、XYQ、XBPQ、hipy",
            "重构：支持本地接口或订阅文件",
            "重构：保留云盘、直播、alist等原聚影融合模块",
            "重构：二级切换站源全新设计",
            "重构：资源导入更加丰富"
        ]
    },{
        title: "2024/07/03 V0.2",
        records: [
            "新增：接口管理支持批量启用",
            "修复：hipy_t4链接入参漏传问题",
            "修复：hipy_t3/t4播放带header",
            "修复：订阅文件部份逻辑，支持本地t3",
            "重构：因缓存等原因t3环境引擎采用L佬独创的代码"
        ]
    },{
        title: "2024/07/06 V0.3",
        records: [
            "新增：接口管理支持批量启用",
            "修复：接口分享列表错误问题",
            "修复：hipy_t3/t4无法二级无法切源问题",
            "修复：选集标题判断错误问题",
            "优化：管理界面美化，加上日志控件、手工更新等",
            "优化：二级切源逻辑完善动态更新id"
        ]
    },{
        title: "2024/07/07 V0.4",
        records: [
            "新增：接口管理支持设置优选",
            "修复：接口和解析管理乱序问题",
            "优化：搜索方式支持分组接口，其他细节",
            "优化：搜索接口分组>优选>前50",
            "优化：二级切源搜索每次20进行手工确认",
            "优化：二级切源我的云盘置顶，其他细节"
        ]
    }]
};
